Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: This engine has no transactions, so the extra rows were already written. '%@' has no primary key, so identical rows cannot be told apart.
fr: Ce moteur n'a pas de transactions, donc les lignes supplémentaires ont déjà été écrites. '%@' n'a pas de clé primaire, donc les lignes identiques ne peuvent pas être distinguées.
ko: 이 엔진에는 트랜잭션이 없어 추가된 행이 이미 기록되었습니다. '%@'에는 기본 키가 없어 동일한 행을 구분할 수 없습니다.
tr: Bu motorda işlem yok, bu yüzden fazladan satırlar zaten yazıldı. '%@' birincil anahtara sahip değil, bu yüzden aynı satırlar birbirinden ayırt edilemiyor.
vi: Engine này không có transaction nên các dòng thừa đã được ghi. '%@' không có khoá chính nên không thể phân biệt các dòng giống nhau.
zh_hans: 此引擎没有事务，因此多出来的行已经写入。'%@' 没有主键，因此无法区分完全相同的行。
zh_hant: 此引擎沒有交易，因此多出來的列已經寫入。'%@' 沒有主鍵，因此無法區分完全相同的列。

source: Drop owned objects
fr: Déposer des objets possédés
ko: 소유한 객체 삭제
tr: Sahip olunan nesneleri sil
vi: Xoá các đối tượng sở hữu
zh_hans: 删除拥有的对象
zh_hant: 刪除擁有的物件

source: %@ cannot be scripted, because its definition is not a statement that recreates it.
fr: %@ ne peut pas être scripté, car sa définition n’est pas une instruction qui le recrée.

source: The statements ran but the transaction could not be committed: %@
fr: Les déclarations ont été exécutées mais la transaction n'a pas pu être effectuée : %@
ko: 구문은 실행되었지만 트랜잭션을 커밋할 수 없었습니다: %@
tr: İfadeler çalıştı ama işlem tamamlanamadı: %@
vi: Các câu lệnh đã chạy nhưng không thể commit giao dịch: %@
zh_hans: 语句已执行，但事务无法提交：%@
zh_hant: 陳述式已執行，但交易無法提交：%@

source: Invalid PHP Serialized Value
fr: Valeur sérialisée PHP invalide
ko: 잘못된 PHP 직렬화 값
tr: Geçersiz PHP Serileştirilmiş Değer
vi: Giá trị PHP serialized không hợp lệ
zh_hans: 无效的 PHP 序列化值
zh_hant: 無效的 PHP 序列化值

source: Sync Categories
fr: Catégories de synchronisation
ko: 동기화 범주
tr: Eşitleme Kategorileri
vi: Danh mục đồng bộ
zh_hans: 同步分类
zh_hant: 同步分類

source: Choose where to copy to.
fr: Choisissez où copier.

source: Optional. A key from the Cursor dashboard is used instead of signing in.
fr: Facultatif. Une clé du tableau de bord du curseur est utilisée au lieu de se connecter.
ko: 선택 사항입니다. 로그인하는 대신 Cursor 대시보드에서 발급한 키를 사용합니다.
tr: İsteğe bağlı. Giriş yapmak yerine Cursor panosundan bir anahtar kullanılır.
vi: Tùy chọn. Một khóa từ bảng điều khiển Cursor được dùng thay cho đăng nhập.
zh_hans: 可选。使用来自 Cursor 仪表板的密钥，而不是登录。
zh_hant: 選用。使用來自 Cursor 儀表板的金鑰，而非登入。

source: Match all filters or any filter
fr: Correspondre à tous les filtres ou à tout filtre
ko: 모든 필터 또는 하나 이상의 필터와 일치
tr: Tüm filtreleri veya herhangi bir filtreyi eşleştir
vi: Khớp tất cả bộ lọc hoặc bất kỳ bộ lọc nào
zh_hans: 匹配全部筛选条件或任一筛选条件
zh_hant: 符合所有篩選條件或任一篩選條件

source: Duplicate
fr: Duplicata
ko: 복제
tr: Çoğalt
vi: Nhân bản
zh_hans: 复制
zh_hant: 製作複本

source: Remove Element
fr: Supprimer l'élément
ko: 요소 제거
tr: Öğeyi Kaldır
vi: Xoá phần tử
zh_hans: 移除元素
zh_hant: 移除元素

source: Unsupported image format
fr: Format d'image non pris en charge
ko: 지원되지 않는 이미지 형식
tr: Desteklenmeyen görüntü biçimi
vi: Định dạng ảnh không được hỗ trợ
zh_hans: 不支持的图像格式
zh_hant: 不支援的影像格式

source: Parent table
fr: Table parent
ko: 상위 테이블
tr: Üst tablo
vi: Bảng cha
zh_hans: 父表
zh_hant: 父資料表

source: Change Case
fr: Changer de casse

source: Expand All
fr: Développer tout
ko: 모두 펼치기
tr: Tümünü Genişlet
vi: Mở rộng tất cả
zh_hans: 全部展开
zh_hant: 全部展開

source: Show History
fr: Afficher l'historique

source: Rows are copied into tables that already exist on the destination.
fr: Les lignes sont copiées dans des tables qui existent déjà sur la destination.

source: Import from Other App
fr: Importer depuis une autre application
ko: 다른 앱에서 가져오기
tr: Diğer Uygulamadan İçe Aktar
vi: Nhập từ ứng dụng khác
zh_hans: 从其他应用导入
zh_hant: 從其他 App 匯入

source: Use Required for AstraDB, DataStax Astra, and other hosted Cassandra deployments.
fr: Utilisé nécessaire pour AstraDB, DataStax Astra et d'autres déploiements Cassandra hébergés.
ko: AstraDB, DataStax Astra 및 기타 호스팅된 Cassandra 배포에서는 Required를 사용하십시오.
tr: AstraDB, DataStax Astra ve diğer barındırılan Cassandra dağıtımları için Required kullanın.
vi: Dùng Required cho AstraDB, DataStax Astra và các triển khai Cassandra được lưu trữ khác.
zh_hans: 对于 AstraDB、DataStax Astra 和其他托管 Cassandra 部署，请使用“必需”。
zh_hant: 對於 AstraDB、DataStax Astra 和其他託管的 Cassandra 部署，請使用「必要」。

source: Collapse Junction Tables
fr: Collapse des tables de jonction
ko: 조인 테이블 축소
tr: Bağlantı Tablolarını Daralt
vi: Thu gọn bảng trung gian
zh_hans: 折叠关联表
zh_hant: 摺疊關聯資料表

source: Failed to compress data
fr: Échec de la compression des données
ko: 데이터를 압축하지 못했습니다
tr: Veri sıkıştırılamadı
vi: Không thể nén dữ liệu
zh_hans: 压缩数据失败
zh_hant: 壓縮資料失敗

source: Move Rule Down
fr: Déplacer la règle vers le bas

source: Open %@
fr: Ouvrir %@
ko: %@ 열기
tr: %@ Aç
vi: Mở %@
zh_hans: 打开 %@
zh_hant: 開啟 %@

# Query result row cap must be between %@ and %@
source: Query result row cap must be between %1$@ and %2$@
fr: La limite de la ligne de résultat de la requête doit être comprise entre %1$@ et %2$@.
ko: 쿼리 결과 행 상한은 %1$@에서 %2$@ 사이여야 합니다
tr: Sorgu sonucu satır sınırı %@ ile %@ arasında olmalıdır
vi: Giới hạn số hàng kết quả phải nằm trong khoảng %@ đến %@
zh_hans: 查询结果行数上限必须在 %@ 和 %@ 之间
zh_hant: 查詢結果列數上限必須介於 %1$@ 到 %2$@ 之間

source: Local Listener
fr: Écouteur local
ko: 로컬 리스너
tr: Yerel Dinleyici
vi: Trình lắng nghe cục bộ
zh_hans: 本地监听器
zh_hant: 本機監聽器

source: Edit Connection
fr: Modifier la connexion
ko: 연결 편집
tr: Bağlantıyı Düzenle
vi: Sửa kết nối
zh_hans: 编辑连接
zh_hant: 編輯連線

source: SOCKS proxy connections need macOS 14 or later. Use an SSH tunnel instead, or update macOS.
fr: Les connexions proxy SOCKS nécessitent macOS 14 ou ultérieur. Utilisez plutôt un tunnel SSH ou mettez à jour macOS.

source: Open or focus a TablePro window for a saved connection. Returns once the window has a tab, with the window id that list_recent_tabs reports.
fr: Ouvrez ou concentrez une fenêtre TablePro pour une connexion enregistrée. Retourne une fois que la fenêtre a une onglet, avec l'identifiant de la fenêtre que list_recent_tabs rapporte.
ko: 저장된 연결의 TablePro 창을 열거나 앞으로 가져옵니다. 창에 탭이 생기면 list_recent_tabs가 보고하는 창 id와 함께 반환합니다.
tr: Kayıtlı bir bağlantı için bir TablePro penceresi açar veya öne getirir. Pencerede bir sekme oluştuğunda, list_recent_tabs'in bildirdiği pencere kimliğiyle döner.
vi: Mở hoặc chuyển tới một cửa sổ TablePro cho kết nối đã lưu. Trả về ngay khi cửa sổ có tab, kèm window id mà list_recent_tabs báo cáo.
zh_hans: 为一个已保存的连接打开或聚焦 TablePro 窗口。窗口有标签页后即返回，带有 list_recent_tabs 报告的窗口 id。
zh_hant: 為一個已儲存的連線開啟或聚焦 TablePro 視窗。視窗有標籤頁後即回傳，帶有 list_recent_tabs 回報的視窗 id。

source: %@ had no rows to transfer.
fr: %@ n'avait pas de lignes à transférer.

source: Resume with a fresh tool call budget.
fr: Reprenez avec un nouvel outil appelé budget.
ko: 새 도구 호출 한도로 재개합니다.
tr: Yeni bir araç çağrısı bütçesiyle devam eder.
vi: Tiếp tục với hạn mức gọi công cụ mới.
zh_hans: 以新的工具调用额度继续。
zh_hant: 以新的工具呼叫額度繼續。

# LSP server error (%d): %@
source: LSP server error (%1$d): %2$@
fr: Erreur du serveur LSP (%1$d) : %2$@
ko: LSP 서버 오류(%1$d): %2$@
tr: LSP sunucu hatası (%d): %@
vi: Lỗi LSP server (%d): %@
zh_hans: LSP 服务器错误（%d）：%@
zh_hant: LSP 伺服器錯誤（%1$d）：%2$@

source: Copy as
fr: Copier comme
ko: 다음 형식으로 복사
tr: Şu şekilde kopyala
vi: Sao chép dạng
zh_hans: 复制为
zh_hant: 複製為

source: %1$@ for %2$@
fr: %1$@ pour %2$@

source: the IdentityAgent line for this host in ~/.ssh/config
fr: La ligne IdentityAgent pour cet hôte dans ~/.ssh/config

source: SSH Servers
fr: Serveurs SSH

source: This repository has no commits yet.
fr: Ce référentiel n'a pas encore de commits.

source: The query history database could not be opened, so there is nothing to summarize.
fr: La base de données d'historique des requêtes n'a pas pu être ouverte, donc il n'y a rien à résumer.
ko: 쿼리 기록 데이터베이스를 열 수 없어 요약할 내용이 없습니다.
tr: Sorgu geçmişi veritabanı açılamadı, bu yüzden özetlenecek bir şey yok.
vi: Không mở được cơ sở dữ liệu lịch sử truy vấn, nên không có gì để tổng hợp.
zh_hans: 无法打开查询历史数据库，因此没有可汇总的内容。
zh_hant: 無法開啟查詢歷史資料庫，因此沒有可彙總的內容。

source: Connection Type
fr: Type de connexion
ko: 연결 유형
tr: Bağlantı Türü
vi: Loại kết nối
zh_hans: 连接类型
zh_hant: 連線類型

source: The change could not be saved. Check disk space and permissions, then try again.
fr: Le changement n'a pas pu être sauvegardé. Vérifiez l'espace disque et les permissions, puis réessayez.

source: Block Size
fr: Taille du bloc
ko: 블록 크기
tr: Blok Boyutu
vi: Kích thước khối
zh_hans: 块大小
zh_hant: 區塊大小

source: Preferred requests TLS; the server decides. Required by SQL Server 2022 and Azure SQL Database.
fr: Demandes préférées TLS ; le serveur décide. Nécessaire pour SQL Server 2022 et Azure SQL Database.
ko: 선호는 TLS를 요청하며 서버가 사용 여부를 결정합니다. SQL Server 2022와 Azure SQL Database에는 필수를 사용해야 합니다.
tr: Tercih Edilen TLS ister; karar sunucunundur. SQL Server 2022 ve Azure SQL Database için Zorunlu gerekir.
vi: Preferred yêu cầu TLS; máy chủ quyết định. SQL Server 2022 và Azure SQL Database yêu cầu Required.
zh_hans: “首选”会请求 TLS，由服务器决定。SQL Server 2022 和 Azure SQL Database 要求使用“必需”。
zh_hant: 「首選」會請求 TLS，由伺服器決定。SQL Server 2022 與 Azure SQL Database 要求使用「必要」。

source: Importing passwords from %1$@ reads up to %2$d keychain items. macOS prompts for your login password once per item because each is owned by %1$@. Click Always Allow on each prompt to grant TablePro permanent access. Cancel any prompt to skip the rest.
fr: L'importation des mots de passe de %1$@ lit jusqu'à %2$d éléments du portefeuille de clés. macOS demande votre mot de passe de connexion une fois par élément car chacun appartient à %1$@. Cliquez sur Autoriser toujours sur chaque message pour accorder à TablePro un accès permanent. Annulez tout message pour sauter le reste.
ko: %1$@에서 암호를 가져오면 최대 %2$d개의 키체인 항목을 읽습니다. 각 항목의 소유 앱은 %1$@입니다. 따라서 macOS는 항목마다 로그인 암호를 묻습니다. 각 메시지에서 '항상 허용'을 클릭하면 TablePro에 영구 접근 권한을 부여합니다. 나머지 항목을 건너뛰려면 아무 메시지에서나 취소를 클릭하십시오.
tr: %1$@ uygulamasından parola içe aktarma en fazla %2$d anahtar zinciri öğesi okur. Her öğe %1$@ uygulamasına ait olduğu için macOS her öğe için bir kez oturum açma parolanızı sorar. TablePro'ya kalıcı erişim vermek için her istemde Her Zaman İzin Ver'e tıklayın. Kalanları atlamak için herhangi bir istemi iptal edin.
vi: Nhập mật khẩu từ %1$@ sẽ đọc tối đa %2$d mục trong keychain. macOS hỏi mật khẩu đăng nhập của bạn một lần cho mỗi mục vì mỗi mục thuộc sở hữu của %1$@. Bấm Luôn cho phép ở mỗi lời nhắc để cấp cho TablePro quyền truy cập vĩnh viễn. Hủy bất kỳ lời nhắc nào để bỏ qua phần còn lại.
zh_hans: 从 %1$@ 导入密码最多会读取 %2$d 个钥匙串项。由于每一项都归 %1$@ 所有，macOS 会针对每一项要求输入一次登录密码。请在每个提示中点按“始终允许”以授予 TablePro 永久访问权限。取消任一提示将跳过其余项。
zh_hant: 從 %1$@ 匯入密碼最多會讀取 %2$d 個鑰匙圈項目。由於每一項都歸 %1$@ 所有，macOS 會針對每一項要求輸入一次登入密碼。請在每個提示中點按「總是允許」以授予 TablePro 永久存取權限。取消任一提示將略過其餘項目。

source: Save frequently used queries for quick access.
fr: Enregistrer les requêtes fréquemment utilisées Pour un accès rapide.
ko: 자주 사용하는 쿼리를 저장하여 빠르게 이용하십시오.
tr: Sık kullanılan sorguları hızlı erişim için kaydedin.
vi: Lưu các truy vấn thường dùng để truy cập nhanh.
zh_hans: 保存常用查询 以便快速访问。
zh_hant: 儲存常用查詢 以便快速存取。

source: Slow
fr: Lent
ko: 느림
vi: Chậm
zh_hans: 慢速
zh_hant: 慢速

source: Schema it lives in
fr: Le schéma dans lequel il vit
ko: 속해 있는 스키마
tr: İçinde bulunduğu şema
vi: Schema chứa nó
zh_hans: 它所在的 Schema
zh_hant: 它所在的綱要

source: Table name. Omit to cover the whole schema.
fr: Nom de la table. Omettre pour couvrir tout le schéma.
ko: 테이블 이름입니다. 스키마 전체를 대상으로 하려면 생략하십시오.
tr: Tablo adı. Şemanın tamamını kapsamak için boş bırakın.
vi: Tên bảng. Bỏ trống để bao gồm cả schema.
zh_hans: 表名。省略则涵盖整个 Schema。
zh_hant: 資料表名稱。省略則涵蓋整個綱要。

source: %d columns
fr: %d colonnes
ko: %d개 열
tr: %d sütun
vi: %d cột
zh_hans: %d列
zh_hant: %d 個欄位

source: Always allow %1$@ on %2$@
fr: Autorisez toujours %1$@ sur %2$@

source: Referencing table
fr: Tableau de référence
ko: 참조하는 테이블
tr: Başvuran tablo
vi: Bảng tham chiếu
zh_hans: 发起引用的表
zh_hant: 發起參照的資料表

source: No matching field path
fr: Pas de chemin de champ correspondant
ko: 일치하는 필드 경로 없음
tr: Eşleşen alan yolu yok
vi: Không có đường dẫn trường nào khớp
zh_hans: 没有匹配的字段路径
zh_hant: 沒有符合的欄位路徑

source: First Page
fr: Première page
ko: 첫 페이지
tr: İlk Sayfa
vi: Trang đầu
zh_hans: 第一页
zh_hant: 第一頁

source: Copy Column Name
fr: Copier le nom de la colonne
ko: 열 이름 복사
tr: Sütun Adını Kopyala
vi: Sao chép tên cột
zh_hans: 复制列名
zh_hant: 複製欄位名稱

source: %@ does not support switching schemas in TablePro.
fr: %@ ne prend pas en charge le changement de schémas dans TablePro.
ko: %@에서는 TablePro의 스키마 전환을 지원하지 않습니다.
tr: %@ TablePro'da şema değiştirmeyi desteklemiyor.
vi: %@ không hỗ trợ chuyển schema trong TablePro.
zh_hans: %@在TablePro中不支持切换Schema。
zh_hant: %@ 在 TablePro 中不支援切換綱要。

source: Every 15 minutes
fr: Tous les 15 minutes

source: Definition
fr: Définition
ko: 정의
tr: Tanım
vi: Định nghĩa
zh_hans: 定义
zh_hant: 定義

source: Renew License
fr: Renouveler la licence
ko: 라이선스 갱신
tr: Lisansı Yenile
vi: Gia hạn giấy phép
zh_hans: 续期许可证
zh_hant: 續訂授權

source: Count all rows
fr: Compter toutes les lignes
ko: 모든 행 수 계산
tr: Tüm satırları say
vi: Đếm tất cả hàng
zh_hans: 统计全部行数
zh_hant: 計算所有列數

source: Saved Customizations
fr: Personnalisations enregistrées
ko: 저장된 사용자화
tr: Kaydedilmiş Özelleştirmeler
vi: Tùy chỉnh đã lưu
zh_hans: 已保存的自定义
zh_hant: 已儲存的自訂設定

source: Failed to load databases: %@
fr: Impossible de charger les bases de données : %@
ko: 데이터베이스를 불러오지 못했습니다: %@
tr: Veritabanları yüklenemedi: %@
vi: Tải danh sách cơ sở dữ liệu thất bại: %@
zh_hans: 加载数据库列表失败: %@
zh_hant: 載入資料庫清單失敗：%@

source: Choose what happens to them when the role is dropped.
fr: Choisissez ce qui leur arrive lorsque le rôle est abandonné.
ko: 역할을 삭제할 때 해당 객체를 어떻게 처리할지 선택하십시오.
tr: Rol silindiğinde bunlara ne olacağını seçin.
vi: Chọn điều xảy ra với chúng khi vai trò bị xoá.
zh_hans: 选择删除该角色时如何处理它们。
zh_hant: 選擇刪除該角色時如何處理它們。

source: Include passwords
fr: Inclure les mots de passe
ko: 암호 포함
tr: Parolaları dahil et
vi: Bao gồm mật khẩu
zh_hans: 包含密码
zh_hant: 包含密碼

source: Installing Plugin
fr: Installation du plugin

source: Duplicate Row
fr: Rang de duplication
ko: 행 복제
tr: Satırı Çoğalt
vi: Nhân bản dòng
zh_hans: 复制行
zh_hant: 複製列

source: Foreign key
fr: Clé étrangère

source: %1$@, returns %2$@
fr: %1$@, retourne %2$@
ko: %1$@, %2$@ 반환
tr: %1$@, %2$@ döndürür
vi: %1$@, trả về %2$@
zh_hans: %1$@，返回 %2$@
zh_hant: %1$@，回傳 %2$@

source: Quit & Reopen
fr: Arrêter et rouvrir
ko: 종료 후 다시 열기
tr: Çık ve Yeniden Aç
vi: Thoát và mở lại
zh_hans: 退出并重新打开
zh_hant: 結束並重新開啟

source: Activity Log
fr: Journal d'activités
ko: 활동 로그
tr: Etkinlik Günlüğü
vi: Nhật ký hoạt động
zh_hans: 活动日志
zh_hant: 活動記錄

source: Every row already in %@ is removed.
fr: Chaque ligne déjà dans %@ est supprimée.

source: %@ cannot be narrowed to some rows or columns, because this database has no SQL.
fr: %@ ne peut pas être limité à certaines lignes ou colonnes, car cette base de données ne possède pas de SQL.

source: Truncate %lld tables
fr: Truncation des tables %lld
ko: %lld개 테이블 비우기
tr: Truncate %lld tablo
vi: Làm trống %lld bảng
zh_hans: 清空 %lld 个表
zh_hant: 清空 %lld 個資料表

source: Join the two columns into one, placing this text between the values.
fr: Joignez les deux colonnes en une seule, en plaçant ce texte entre les valeurs.
ko: 두 열을 하나로 결합하고 값 사이에 이 텍스트를 넣습니다.
tr: İki sütunu tek sütunda birleştirir ve değerlerin arasına bu metni koyar.
vi: Gộp hai cột thành một, đặt đoạn văn bản này giữa các giá trị.
zh_hans: 将两列合并为一列，并在两个值之间插入这段文本。
zh_hant: 將兩個欄位合併為一個，並在兩個值之間插入這段文字。

source: Maximum number of entries to return (default 50, max 500)
fr: Nombre maximum d'entrées à retourner (par défaut 50, max 500)
ko: 반환할 최대 항목 수(기본값 50, 최대 500)
tr: Döndürülecek maksimum kayıt sayısı (varsayılan 50, en çok 500)
vi: Số mục tối đa trả về (mặc định 50, tối đa 500)
zh_hans: 返回条目的最大数量（默认 50，最大 500）
zh_hant: 回傳項目的最大數量（預設 50，最大 500）

source: No matching fields
fr: Aucun champ correspondant
ko: 일치하는 필드 없음
tr: Eşleşen alan yok
vi: Không có trường khớp
zh_hans: 无匹配字段
zh_hant: 無符合的欄位

source: Invalid JSON: %@
fr: JSON invalide : %@
ko: 잘못된 JSON: %@
tr: Geçersiz JSON: %@
vi: JSON không hợp lệ: %@
zh_hans: 无效的 JSON: %@
zh_hant: JSON 無效：%@

source: Edit Details (Double-click)
fr: Modifier les détails (double-clic)
ko: 세부사항 편집(이중 클릭)
tr: Ayrıntıları Düzenle (Çift tıklayın)
vi: Sửa chi tiết (Nhấp đúp)
zh_hans: 编辑详情（双击）
zh_hant: 編輯詳細資訊（按兩下）

source: Remove filter row
fr: Supprimer la ligne de filtre
ko: 필터 행 제거
tr: Filtre satırını kaldır
vi: Xóa dòng bộ lọc
zh_hans: 移除筛选行
zh_hant: 移除篩選列

source: No Databases Shown
fr: Aucune base de données n'est affichée.
ko: 표시된 데이터베이스 없음
tr: Gösterilen Veritabanı Yok
vi: Không có cơ sở dữ liệu nào được hiển thị
zh_hans: 未显示数据库
zh_hant: 未顯示資料庫

source: 8+ characters
fr: Plus de 8 caractères
ko: 8자 이상
tr: 8+ karakter
vi: 8+ ký tự
zh_hans: 至少8个字符
zh_hant: 至少 8 個字

source: Client ID
fr: ID client
ko: 클라이언트 ID
zh_hans: 客户端ID
zh_hant: 用戶端 ID

source: Copied!
fr: Copié !
ko: 복사됨!
tr: Kopyalandı!
vi: Đã sao chép!
zh_hans: 已复制！
zh_hant: 已複製！

source: The %@ plugin could not be loaded.
fr: Le plugin %@ n'a pas pu être chargé.

source: The following %1$d queries may permanently modify or delete data. This action cannot be undone. %2$@
fr: Les requêtes suivantes %1$d peuvent modifier ou supprimer définitivement les données. Cette action ne peut pas être annulée. %2$@
ko: 다음 %1$d개 쿼리는 데이터를 영구적으로 변경하거나 삭제할 수 있습니다. 이 작업은 실행 취소할 수 없습니다. %2$@
tr: Aşağıdaki %d sorgu verileri kalıcı olarak değiştirebilir veya silebilir. Bu işlem geri alınamaz. %@
vi: %d truy vấn sau có thể sửa đổi hoặc xóa dữ liệu vĩnh viễn. Hành động này không thể hoàn tác. %@
zh_hans: 以下 %d 条查询可能永久修改或删除数据。此操作无法撤销。 %@
zh_hant: 下列 %1$d 個查詢可能會永久修改或刪除資料。此動作無法復原。 %2$@

source: Downloading the %@ plugin…
fr: Téléchargement du plugin %@...

source: Remote database file path is required
fr: Le chemin de fichier de la base de données distante est requis.
ko: 원격 데이터베이스 파일 경로가 필요합니다
tr: Uzak veritabanı dosya yolu gerekli
vi: Cần có đường dẫn tệp cơ sở dữ liệu từ xa
zh_hans: 必须填写远程数据库文件路径
zh_hant: 必須填寫遠端資料庫檔案路徑

source: On Update
fr: En mise à jour
ko: 업데이트 시
tr: Güncellendiğinde
vi: Khi cập nhật
zh_hans: 更新时
zh_hant: 更新時

source: Clear Query History?
fr: Effacer l'historique des requêtes ?
ko: 쿼리 기록을 지우겠습니까?
tr: Sorgu geçmişi temizlensin mi?
vi: Xoá lịch sử truy vấn?
zh_hans: 要清除查询历史吗？
zh_hant: 要清除查詢歷史嗎？

source: List available commands
fr: Liste des commandes disponibles
ko: 사용 가능한 명령어 나열
tr: Kullanılabilir komutları listele
vi: Liệt kê các lệnh khả dụng
zh_hans: 列出可用命令
zh_hant: 列出可用的指令

source: Are you sure you want to delete "%@"?
fr: Êtes-vous sûr de vouloir supprimer "%@" ?
ko: "%@"을(를) 삭제하시겠습니까?
tr: "%@" öğesini silmek istediğinize emin misiniz?
vi: Bạn có chắc muốn xóa "%@" không?
zh_hans: 确定要删除 "%@" 吗？
zh_hant: 確定要刪除「%@」嗎？

source: Status: error
fr: Statut : erreur
ko: 상태: 오류
tr: Durum: hata
vi: Trạng thái: lỗi
zh_hans: 状态：错误
zh_hant: 狀態：錯誤

source: Edit Comment
fr: Modifier le commentaire

source: macOS will ask for your login password
fr: macOS vous demandera votre mot de passe de connexion.
ko: macOS에서 로그인 암호를 요청합니다
tr: macOS giriş parolanızı isteyecek
vi: macOS sẽ hỏi mật khẩu đăng nhập của bạn
zh_hans: macOS 将要求输入您的登录密码
zh_hant: macOS 會要求你輸入登入密碼

source: Disconnect
fr: Se déconnecter
ko: 연결 해제
tr: Bağlantıyı Kes
vi: Ngắt kết nối
zh_hans: 断开连接
zh_hant: 中斷連線

source: %@, open in this window
fr: %@, ouvrir dans cette fenêtre

source: Filter privileges
fr: Filtrer les privilèges
ko: 권한 필터링
tr: Yetkileri filtrele
vi: Lọc quyền
zh_hans: 筛选权限
zh_hant: 篩選權限

source: A single click opens each table in the same preview tab. Double-click a table, or press Return, to keep it open.
fr: Un seul clic ouvre chaque table dans la même onglet d'aperçu. Faites double clic sur une table ou appuyez sur Retour pour la garder ouverte.
ko: 한 번 클릭하면 각 테이블이 같은 미리보기 탭에서 열립니다. 테이블을 이중 클릭하거나 Return 키를 누르면 열린 상태로 유지됩니다.
tr: Tek tıklama her tabloyu aynı önizleme sekmesinde açar. Açık tutmak için tabloya çift tıklayın veya Return tuşuna basın.
vi: Nhấp một lần sẽ mở từng bảng trong cùng một tab xem trước. Nhấp đúp vào bảng hoặc nhấn Return để giữ nó mở.
zh_hans: 单击会在同一个预览标签页中打开每个表格。双击表格或按 Return 键即可保持打开。
zh_hant: 按一下會在同一個預覽標籤頁中開啟每個表格。按兩下表格或按 Return 鍵即可保持開啟。

source: Next Page (⌘])
fr: Page suivante (⌘])
ko: 다음 페이지 (⌘])
vi: Trang sau (⌘])
zh_hans: 下一页 (⌘])
zh_hant: 下一頁 (⌘])

source: iCloud Sync:
fr: Synchronisation iCloud :
ko: iCloud 동기화:
tr: iCloud Eşitlemesi:
vi: Đồng bộ iCloud:
zh_hans: iCloud 同步：
zh_hant: iCloud 同步：

source: Table Maintenance
fr: Entretien de la table
ko: 테이블 유지 관리
tr: Tablo Bakımı
vi: Bảo trì bảng
zh_hans: 表维护
zh_hant: 資料表維護

source: %@ faster than the baseline
fr: %@ plus rapide que la ligne de base
ko: 기준보다 %@ 빠름
tr: temel plandan %@ daha hızlı
vi: Nhanh hơn %@ so với bản gốc
zh_hans: 比基准快 %@
zh_hant: 比基準快 %@

source: Optimize Table
fr: Optimiser la table

source: %d of 1 table will be compared.
fr: %d de 1 table seront comparés.
ko: 테이블 1개 중 %d개를 비교합니다.
tr: 1 tablodan %d tanesi karşılaştırılacak.
vi: %d trên 1 bảng sẽ được so sánh.
zh_hans: 将比较 1 个表中的 %d 个。
zh_hant: 將比較 1 個資料表中的 %d 個。

source: Choose which rows of this table are copied
fr: Choisissez quelles lignes de ce tableau sont copiées.

source: Earliest executed_at, Unix epoch seconds
fr: Date d'exécution la plus ancienne, secondes de l'époque Unix
ko: 가장 이른 executed_at이며 Unix epoch 초 단위입니다
tr: En erken executed_at, Unix epoch saniyesi
vi: executed_at sớm nhất, tính bằng giây Unix epoch
zh_hans: 最早的 executed_at，Unix 纪元秒
zh_hant: 最早的 executed_at，Unix 紀元秒

source: Absolute, or relative to the SSH account's home directory. `~` works.
fr: Absolu, ou relatif au répertoire racine du compte SSH. `~` fonctionne.
ko: 절대 경로이거나 SSH 계정의 홈 디렉터리 기준 상대 경로입니다. `~`도 사용할 수 있습니다.
tr: Mutlak yol veya SSH hesabının ana dizinine göre göreli yol. `~` çalışır.
vi: Đường dẫn tuyệt đối, hoặc tương đối với thư mục nhà của tài khoản SSH. `~` dùng được.
zh_hans: 绝对路径，或相对于 SSH 账户主目录的路径。可以使用 `~`。
zh_hant: 絕對路徑，或相對於 SSH 帳號家目錄的路徑。可以使用 `~`。

source: The connection's SQLite extensions were not approved.
fr: Les extensions SQLite de la connexion n'ont pas été approuvées.

source: Compare Now
fr: Comparer maintenant
ko: 지금 비교
tr: Şimdi Karşılaştır
vi: So sánh ngay
zh_hans: 立即比较
zh_hant: 立即比較

source: Edit %@…
fr: Modifier %@...

source: A %@ index has no equivalent on this engine.
fr: Un index %@ n'a pas d'équivalent sur ce moteur.

source: Preview MQL (⌘⇧P)
fr: Aperçu MQL (⌘⇧P)
ko: MQL 미리보기(⌘⇧P)
vi: Xem trước MQL (⌘⇧P)
zh_hans: 预览 MQL (⌘⇧P)
zh_hant: 預覽 MQL (⌘⇧P)

source: SELECT queries without their own LIMIT run with this cap applied. The query text in the editor never changes. Capped results show a Fetch All button, and Execute Without Limit skips the cap for one run.
fr: Les requêtes SELECT sans leur propre LIMIT s'exécutent avec ce seuil appliqué. Le texte de la requête dans l'éditeur ne change jamais. Les résultats limités affichent un bouton "Retirer tout" et "Exécuter sans limite" saute le seuil pour une exécution.
ko: 자체 LIMIT이 없는 SELECT 쿼리는 이 상한을 적용하여 실행됩니다. 편집기의 쿼리 텍스트는 변경되지 않습니다. 제한된 결과에는 '모두 가져오기' 버튼이 표시되며, 한 번만 상한을 건너뛰려면 '제한 없이 실행'을 사용합니다.
tr: Kendi LIMIT'i olmayan SELECT sorguları bu sınırla çalışır. Düzenleyicideki sorgu metni hiç değişmez. Sınırlanan sonuçlarda Tümünü Getir düğmesi görünür, Limitsiz Çalıştır ise sınırı tek seferlik atlar.
vi: Các truy vấn SELECT không có LIMIT riêng sẽ chạy với giới hạn này. Nội dung truy vấn trong trình soạn thảo không hề thay đổi. Kết quả bị giới hạn sẽ hiện nút Tải tất cả, còn Chạy không giới hạn sẽ bỏ qua giới hạn cho một lần chạy.
zh_hans: 没有自带 LIMIT 的 SELECT 查询会按此上限运行。编辑器中的查询文本不会被改动。被截断的结果会显示“获取所有行”按钮，“不限行数执行”则对单次运行跳过上限。
zh_hant: 沒有自帶 LIMIT 的 SELECT 查詢會套用此上限。編輯器中的查詢文字不會被更動。被截斷的結果會顯示「取得所有列」按鈕，「不限列數執行」則對單次執行略過上限。
